[
  {
    "text": "Who is widely considered the first computer programmer?",
    "hint": "This person wrote theoretical programs for the Babbage mechanical computer",
    "answer": "C",
    "choices": {
      "A": "Alan Turing",
      "B": "Isaac Newton",
      "C": "Ada Lovelace",
      "D": "Linus Torvalds"
    }
  },
  {
    "text": "What was the name of the first programmable electronic general purpose computer?",
    "hint": "This device was designed for numerical computation",
    "answer": "B",
    "choices": {
      "A": "Deep Blue",
      "B": "ENIAC",
      "C": "The Colossus",
      "D": "CSIRAC"
    }
  },
  {
    "text": "What was the first compiled high-level programming language?",
    "hint": "This programming language is still in use today, although very rarely",
    "answer": "D",
    "choices": {
      "A": "COBOL",
      "B": "C",
      "C": "Autocode",
      "D": "FORTRAN"
    }
  },
  {
    "text": "Which programming language was created by Netscape to add dynamic behavior to web pages?",
    "hint": "Unlike a language with a similar name, this one wasn't used to write Minecraft",
    "answer": "B",
    "choices": {
      "A": "Ruby",
      "B": "JavaScript",
      "C": "Java",
      "D": "HTML"
    }
  },
  {
    "text": "Who is considered the inventor of the World Wide Web?",
    "hint": "This English Computer scienctist is still alive today and doesn't have a penchant for naming things after himself.",
    "answer": "A",
    "choices": {
      "A": "Tim Berners-Lee",
      "B": "Linus Torvalds",
      "C": "Charles Babbage",
      "D": "James Conway"
    }
  },
  {
    "text": "What is the most common low level language in use today?",
    "hint": "Released in 1972, it has two successors with similar names that add more high level features.",
    "answer": "C",
    "choices": {
      "A": "Autocode",
      "B": "BASIC",
      "C": "C",
      "D": "Python"
    }
  },
  {
    "text": "What is considred the first dynamically typed language?",
    "hint": "This language broke new ground in many ways and still has a cult following, notably Randal Munroe of XKCD.",
    "answer": "D",
    "choices": {
      "A": "Smalltalk",
      "B": "FORTRAN",
      "C": "Ruby",
      "D": "LISP"
    }
  },
  {
    "text": "What does RISC stand for?",
    "hint": "This was a style of computer architecture that reduced complexity for more optimized chips but less human programmable assembly",
    "answer": "B",
    "choices": {
      "A": "Really Intuitive Style Chip",
      "B": "Reduced Instruction Set Computer",
      "C": "Random Insert System Calculus",
      "D": "Rotational Inertial Space Combinator"
    }
  }
]
